package com.suning.cus.constants;

public class ArrayData {


    public static String getAssuranceCode(String name) {
        if (name.equals("保内")) {
            return "01";
        }

        if (name.equals("保外")) {
            return "02";
        }

        if (name.equals("延保")) {
            return "03";
        }

        if (name.equals("意外保")) {
            return "04";
        }

        return null;
    }


    public static String getAssuranceName(String code) {
        if (code.equals("01")) {
            return "保内";
        }

        if (code.equals("02")) {
            return "保外";
        }

        if (code.equals("03")) {
            return "延保";
        }

        if (code.equals("04")) {
            return "意外保";
        }

        return null;
    }


    /**
     * 未完成原因用于二级spinner显示
     */
    public static String[][] mReasonData = new String[][]{

            {"顾客家中条件不具备/装修", "顾客不认可收费", "顾客要求"}, {"送货不及时/错送/漏送附件/途中损坏", "连锁店输单错误(联系方式、地址等)", "客服输单错误(联系方式、地址等)", "客服服务承诺(时间/项目/收费)不规范", "连锁店服务承诺(时间/项目/收费)不规范"}, {"天气原因", "联系不上顾客"}, {"工具材料不全", "申配(另约)", "内修(另约)", "派工不准确、不合理", "留检", "异地送修送检", "售后信息传递不及时(含异常信息处理不当)"}};
    public static String[][] mReasonId = new String[][]{{"001001", "001002", "001003", "001005", "001006", "001007", "001008", "001009", "0010010", "001011", "001012", "001013"}, {"002001", "002007", "002008", "002009", "002010"}, {"003001", "003002", "003003"}, {"004001", "004002"}};
    // 未完成原因用于二级spinner取代码
    public static String[] mOtherDateReason = {"001001-私自改约", "001002-上门不及时", "001003-工具材料不全", "001005-服务技能差", "001006-申配(另约)", "001007-内修(另约)", "001008-派工不准确、不合理", "001009-留检", "001010-异地送修送检", "001011-工程师乱收费", "001012-工程师服务态度差", "001013-售后信息传递不及时(含异常信息处理不当)", "002001-送货不及时/错送/漏送附件/途中损坏", "002007-连锁店输单错误(联系方式、地址等)", "002008-客服输单错误(联系方式、地址等)", "002009-客服服务承诺(时间/项目/收费)不规范", "002010-连锁店服务承诺(时间/项目/收费)不规范", "003001-顾客家中条件不具备/装修", "003002-顾客不认可收费", "003003-顾客要求", "004001-天气原因", "004002-联系不上顾客"};
    /**
     * 服务取消原因数据
     */
    public static String[] mCodeGroup = new String[]{"ZC000005", "ZC000006", "ZC000007", "ZC000008", "ZC000009", "ZC000010", "ZC000011", "ZC000012", "ZC000013", "ZC000015", "ZC000015", "ZC000016"};
    public static String[] mCodeConnect = new String[]{"ZS01,ZC000005,C02", "ZS01,ZC000005,C03", "ZS01,ZC000005,C04", "ZS01,ZC000005,C05", "ZS01,ZC000005,C06", "ZS01,ZC000005,C07", "ZS02,ZC000006,C02", "ZS02,ZC000006,C03", "ZS02,ZC000006,C04", "ZS02,ZC000006,C05", "ZS02,ZC000006,C06", "ZS02,ZC000006,C07", "ZS03,ZC000007,C02", "ZS03,ZC000007,C03", "ZS03,ZC000007,C04", "ZS03,ZC000007,C05", "ZS04,ZC000008,C02", "ZS04,ZC000008,C03", "ZS04,ZC000008,C04", "ZS04,ZC000008,C05", "ZS06,ZC000009,C02", "ZS06,ZC000009,C03", "ZS06,ZC000009,C04", "ZS06,ZC000009,C05", "ZS06,ZC000009,C06", "ZS07,ZC000010,C02", "ZS07,ZC000010,C03", "ZS07,ZC000010,C04", "ZS07,ZC000010,C05", "ZS08,ZC000011,C02", "ZS08,ZC000011,C03", "ZS11,ZC000012,C02", "ZS11,ZC000012,C03", "ZS11,ZC000012,C04", "ZS12,ZC000013,C02", "ZS12,ZC000013,C03", "ZS12,ZC000013,C04", "ZS12,ZC000013,C05", "ZGS5,ZC000015,C02", "ZGS5,ZC000015,C03", "ZGS5,ZC000015,C04", "ZGS5,ZC000015,C05", "ZGS6,ZC000015,C02", "ZGS6,ZC000015,C03", "ZGS6,ZC000015,C04", "ZGS6,ZC000015,C05", "ZGS8,ZC000016,C02", "ZGS8,ZC000016,C03", "ZGS8,ZC000016,C04", "ZGS8,ZC000016,C05"};

    public static String[] mServiceOrderType = new String[]{"ZS01", "ZS02", "ZS03", "ZS04", "ZS06", "ZS07", "ZS08", "ZS11", "ZS12", "ZGS5", "ZGS6", "ZGS8"};

    public static String[][] mCancleDesc = new String[][]{{"服务订单错误", "退换货相关", "不具备安装条件", "授权品牌被他人安装", "电脑、批发单据，不需安装", "上门整改或者电话解释认可，不予工程师结算"},// ZS01
            {"服务订单错误", "退换货相关", "授权品牌被他人安装", "电脑、批发单据，不需安装", "上门整改或者电话解释认可，不予工程师结算", "不具备安装条件"},// ZS02
            {"服务订单错误", "授权品牌被他人安装", "不具备安装条件", "上门整改或者电话解释认可，不予工程师结算"},// ZS03
            {"服务订单错误", "退换货相关", "授权品牌被他人安装", "上门整改或者电话解释认可，不予工程师结算"},// ZS04
            {"服务订单错误", "退换货相关", "授权品牌被他人维修", "上门整改或者电话解释认可，不予工程师结算", "不具备维修条件"},// ZS06
            {"服务订单错误", "退换货相关", "上门整改或者电话解释认可，不予工程师结算", "不具备维修条件"},// ZS07
            {"服务订单错误", "上门整改或者电话解释认可，不予工程师结算"},// ZS08
            {"服务订单错误", "退换货相关", "上门整改或者电话解释认可，不予工程师结算"},// ZS11
            {"服务订单错误", "退换货相关", "不具备维修条件", "上门整改或者电话解释认可，不予工程师结算"},// ZS12
            {"服务订单错误", "退换货相关", "上门整改或者电话解释认可，不予工程师结算", "授权品牌被他人安装"},// ZGS5
            {"服务订单错误", "退换货相关", "上门整改或者电话解释认可，不予工程师结算", "授权品牌被他人安装"},// ZGS6
            {"服务订单错误", "上门整改或者电话解释认可，不予工程师结算", "不具备维修条件", "授权品牌被他人维修"}};// ZGS8

    public static String[][] mCancleData = new String[][]{{"ZS01-ZC000005-C02-服务订单错误", "ZS01-ZC000005-C03-退换货相关", "ZS01-ZC000005-C04-不具备安装条件", "ZS01-ZC000005-C05-授权品牌被他人安装", "ZS01-ZC000005-C06-电脑、批发单据，不需安装", "ZS01-ZC000005-C07-上门整改或者电话解释认可，不予工程师结算"}, {"ZS02-ZC000006-C02-服务订单错误", "ZS02-ZC000006-C03-退换货相关", "ZS02-ZC000006-C04-授权品牌被他人安装", "ZS02-ZC000006-C05-电脑、批发单据，不需安装", "ZS02-ZC000006-C06-上门整改或者电话解释认可，不予工程师结算", "ZS02-ZC000006-C07-不具备安装条件"}, {"ZS03-ZC000007-C02-服务订单错误", "ZS03-ZC000007-C03-授权品牌被他人安装", "ZS03-ZC000007-C04-不具备安装条件", "ZS03-ZC000007-C05-上门整改或者电话解释认可，不予工程师结算"}, {"ZS04-ZC000008-C02-服务订单错误", "ZS04-ZC000008-C03-退换货相关", "ZS04-ZC000008-C04-授权品牌被他人安装", "ZS04-ZC000008-C05-上门整改或者电话解释认可，不予工程师结算"}, {"ZS06-ZC000009-C02-服务订单错误", "ZS06-ZC000009-C03-退换货相关", "ZS06-ZC000009-C04-授权品牌被他人维修", "ZS06-ZC000009-C05-上门整改或者电话解释认可，不予工程师结算", "ZS06-ZC000009-C06-不具备维修条件"}, {"ZS07-ZC000010-C02-服务订单错误", "ZS07-ZC000010-C03-退换货相关", "ZS07-ZC000010-C04-上门整改或者电话解释认可，不予工程师结算", "ZS07-ZC000010-C05-不具备维修条件"}, {"ZS08-ZC000011-C02-服务订单错误", "ZS08-ZC000011-C03-上门整改或者电话解释认可，不予工程师结算"}, {"ZS11-ZC000012-C02-服务订单错误", "ZS11-ZC000012-C03-退换货相关", "ZS11-ZC000012-C04-上门整改或者电话解释认可，不予工程师结算"}, {"ZS12-ZC000013-C02-服务订单错误", "ZS12-ZC000013-C03-退换货相关", "ZS12-ZC000013-C04-不具备维修条件", "ZS12-ZC000013-C05-上门整改或者电话解释认可，不予工程师结算"}, {"ZGS5-ZC000015-C02-服务订单错误", "ZGS5-ZC000015-C03-退换货相关", "ZGS5-ZC000015-C04-上门整改或者电话解释认可，不予工程师结算", "ZGS5-ZC000015-C05-授权品牌被他人安装"}, {"ZGS6-ZC000015-C02-服务订单错误", "ZGS6-ZC000015-C03-退换货相关", "ZGS6-ZC000015-C04-上门整改或者电话解释认可，不予工程师结算", "ZGS6-ZC000015-C05-授权品牌被他人安装"}, {"ZGS8-ZC000016-C02-服务订单错误", "ZGS8-ZC000016-C03-上门整改或者电话解释认可，不予工程师结算", "ZGS8-ZC000016-C04-不具备维修条件", "ZGS8-ZC000016-C05-授权品牌被他人维修"}};
    /**
     * 层次查询一级数据
     */
    public static final String CATEGORY_IDS[] = {"01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12", "13", "14"};
    public static final String CATEGORY_NAMES[] = {"空调", "黑电", "冰洗", "厨卫电器", "生活电器", "通讯", "数码", "电脑", "OA办公", "商用机", "自主产品", "运营商", "其他", "工具"};
    public static final String CATEGORY_CODES[] = {"00001", "00003", "00002", "00013", "00007", "00006", "00004", "00005", "00011", "00008", "00010", "00011", "00009", "00071"};

}
